# Functions of Pandas dataframe

After assigning a dataframe to a variable .That variable will have some functions

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Mall_customers.csv")

In [3]:
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

# 1) df.index

Display the index of the dataframe

In [4]:
df.index

RangeIndex(start=0, stop=200, step=1)

# 2) df.columns

columns of the dataframe

In [5]:
df.columns

Index(['CustomerID', 'Genre', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

# 3) df.dtypes

return the datatype of column

In [6]:
df.dtypes

CustomerID                 int64
Genre                     object
Age                        int64
Annual Income (k$)         int64
Spending Score (1-100)     int64
dtype: object

# 4) df.info

returns the entire information includes memory usage of the dataframe

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

# 5)df.select_dtypes()

Return a subset of dataframe with specified datatype.

In [8]:
df.select_dtypes(include='int64')
# return df contains only int64

     CustomerID  Age  Annual Income (k$)  Spending Score (1-100)
0             1   19                  15                      39
1             2   21                  15                      81
2             3   20                  16                       6
3             4   23                  16                      77
4             5   31                  17                      40
..          ...  ...                 ...                     ...
195         196   35                 120                      79
196         197   45                 126                      28
197         198   32                 126                      74
198         199   32                 137                      18
199         200   30                 137                      83

[200 rows x 4 columns]

In [9]:
df.select_dtypes(exclude='int64')
# exclude df exclude int64

      Genre
0      Male
1      Male
2    Female
3    Female
4    Female
..      ...
195  Female
196  Female
197    Male
198    Male
199    Male

[200 rows x 1 columns]

# 6) df.values

return a numpy representation of the dataframe

In [10]:
df.values

array([[1, 'Male', 19, 15, 39],
       [2, 'Male', 21, 15, 81],
       [3, 'Female', 20, 16, 6],
       [4, 'Female', 23, 16, 77],
       [5, 'Female', 31, 17, 40],
       [6, 'Female', 22, 17, 76],
       [7, 'Female', 35, 18, 6],
       [8, 'Female', 23, 18, 94],
       [9, 'Male', 64, 19, 3],
       [10, 'Female', 30, 19, 72],
       [11, 'Male', 67, 19, 14],
       [12, 'Female', 35, 19, 99],
       [13, 'Female', 58, 20, 15],
       [14, 'Female', 24, 20, 77],
       [15, 'Male', 37, 20, 13],
       [16, 'Male', 22, 20, 79],
       [17, 'Female', 35, 21, 35],
       [18, 'Male', 20, 21, 66],
       [19, 'Male', 52, 23, 29],
       [20, 'Female', 35, 23, 98],
       [21, 'Male', 35, 24, 35],
       [22, 'Male', 25, 24, 73],
       [23, 'Female', 46, 25, 5],
       [24, 'Male', 31, 25, 73],
       [25, 'Female', 54, 28, 14],
       [26, 'Male', 29, 28, 82],
       [27, 'Female', 45, 28, 32],
       [28, 'Male', 35, 28, 61],
       [29, 'Female', 40, 29, 31],
       [30, 'Female', 23, 29, 87],
       [31, 'Male', 60, 30, 4],
       [32, 'Female', 21, 30, 73],
       [33, 'Male', 53, 33, 4],
       [34, 'Male', 18, 33, 92],
       [35, 'Female', 49, 33, 14],
       [36, 'Female', 21, 33, 81],
       [37, 'Female', 42, 34, 17],
       [38, 'Female', 30, 34, 73],
       [39, 'Female', 36, 37, 26],
       [40, 'Female', 20, 37, 75],
       [41, 'Female', 65, 38, 35],
       [42, 'Male', 24, 38, 92],
       [43, 'Male', 48, 39, 36],
       [44, 'Female', 31, 39, 61],
       [45, 'Female', 49, 39, 28],
       [46, 'Female', 24, 39, 65],
       [47, 'Female', 50, 40, 55],
       [48, 'Female', 27, 40, 47],
       [49, 'Female', 29, 40, 42],
       [50, 'Female', 31, 40, 42],
       [51, 'Female', 49, 42, 52],
       [52, 'Male', 33, 42, 60],
       [53, 'Female', 31, 43, 54],
       [54, 'Male', 59, 43, 60],
       [55, 'Female', 50, 43, 45],
       [56, 'Male', 47, 43, 41],
       [57, 'Female', 51, 44, 50],
       [58, 'Male', 69, 44, 46],
       [59, 'Female', 27, 46, 51],
       [60, 'Male', 53, 46, 46],
       [61, 'Male', 70, 46, 56],
       [62, 'Male', 19, 46, 55],
       [63, 'Female', 67, 47, 52],
       [64, 'Female', 54, 47, 59],
       [65, 'Male', 63, 48, 51],
       [66, 'Male', 18, 48, 59],
       [67, 'Female', 43, 48, 50],
       [68, 'Female', 68, 48, 48],
       [69, 'Male', 19, 48, 59],
       [70, 'Female', 32, 48, 47],
       [71, 'Male', 70, 49, 55],
       [72, 'Female', 47, 49, 42],
       [73, 'Female', 60, 50, 49],
       [74, 'Female', 60, 50, 56],
       [75, 'Male', 59, 54, 47],
       [76, 'Male', 26, 54, 54],
       [77, 'Female', 45, 54, 53],
       [78, 'Male', 40, 54, 48],
       [79, 'Female', 23, 54, 52],
       [80, 'Female', 49, 54, 42],
       [81, 'Male', 57, 54, 51],
       [82, 'Male', 38, 54, 55],
       [83, 'Male', 67, 54, 41],
       [84, 'Female', 46, 54, 44],
       [85, 'Female', 21, 54, 57],
       [86, 'Male', 48, 54, 46],
       [87, 'Female', 55, 57, 58],
       [88, 'Female', 22, 57, 55],
       [89, 'Female', 34, 58, 60],
       [90, 'Female', 50, 58, 46],
       [91, 'Female', 68, 59, 55],
       [92, 'Male', 18, 59, 41],
       [93, 'Male', 48, 60, 49],
       [94, 'Female', 40, 60, 40],
       [95, 'Female', 32, 60, 42],
       [96, 'Male', 24, 60, 52],
       [97, 'Female', 47, 60, 47],
       [98, 'Female', 27, 60, 50],
       [99, 'Male', 48, 61, 42],
       [100, 'Male', 20, 61, 49],
       [101, 'Female', 23, 62, 41],
       [102, 'Female', 49, 62, 48],
       [103, 'Male', 67, 62, 59],
       [104, 'Male', 26, 62, 55],
       [105, 'Male', 49, 62, 56],
       [106, 'Female', 21, 62, 42],
       [107, 'Female', 66, 63, 50],
       [108, 'Male', 54, 63, 46],
       [109, 'Male', 68, 63, 43],
       [110, 'Male', 66, 63, 48],
       [111, 'Male', 65, 63, 52],
       [112, 'Female', 19, 63, 54],
       [113, 'Female', 38, 64, 42],
       [114, 'Male', 19, 64, 46],
       [115, 'Female', 18, 65, 48],
       [116, 'Female', 19, 65, 50],
       [117, 'Female', 63, 65, 43],
       [118, 'Female', 49, 65, 59],
       [119, 'Female', 51, 67, 43],
       [120, 'Female', 50, 67, 57],
       [121, 'Male', 27, 67, 56],
       [122, 'Female', 38, 67, 40],
       [123, 'Female', 40, 69, 58],
       [124, 'Male', 39, 69, 91],
       [125, 'Female', 23, 70, 29],
       [126, 'Female', 31, 70, 77],
       [127, 'Male', 43, 71, 35],
       [128, 'Male', 40, 71, 95],
       [129, 'Male', 59, 71, 11],
       [130, 'Male', 38, 71, 75],
       [131, 'Male', 47, 71, 9],
       [132, 'Male', 39, 71, 75],
       [133, 'Female', 25, 72, 34],
       [134, 'Female', 31, 72, 71],
       [135, 'Male', 20, 73, 5],
       [136, 'Female', 29, 73, 88],
       [137, 'Female', 44, 73, 7],
       [138, 'Male', 32, 73, 73],
       [139, 'Male', 19, 74, 10],
       [140, 'Female', 35, 74, 72],
       [141, 'Female', 57, 75, 5],
       [142, 'Male', 32, 75, 93],
       [143, 'Female', 28, 76, 40],
       [144, 'Female', 32, 76, 87],
       [145, 'Male', 25, 77, 12],
       [146, 'Male', 28, 77, 97],
       [147, 'Male', 48, 77, 36],
       [148, 'Female', 32, 77, 74],
       [149, 'Female', 34, 78, 22],
       [150, 'Male', 34, 78, 90],
       [151, 'Male', 43, 78, 17],
       [152, 'Male', 39, 78, 88],
       [153, 'Female', 44, 78, 20],
       [154, 'Female', 38, 78, 76],
       [155, 'Female', 47, 78, 16],
       [156, 'Female', 27, 78, 89],
       [157, 'Male', 37, 78, 1],
       [158, 'Female', 30, 78, 78],
       [159, 'Male', 34, 78, 1],
       [160, 'Female', 30, 78, 73],
       [161, 'Female', 56, 79, 35],
       [162, 'Female', 29, 79, 83],
       [163, 'Male', 19, 81, 5],
       [164, 'Female', 31, 81, 93],
       [165, 'Male', 50, 85, 26],
       [166, 'Female', 36, 85, 75],
       [167, 'Male', 42, 86, 20],
       [168, 'Female', 33, 86, 95],
       [169, 'Female', 36, 87, 27],
       [170, 'Male', 32, 87, 63],
       [171, 'Male', 40, 87, 13],
       [172, 'Male', 28, 87, 75],
       [173, 'Male', 36, 87, 10],
       [174, 'Male', 36, 87, 92],
       [175, 'Female', 52, 88, 13],
       [176, 'Female', 30, 88, 86],
       [177, 'Male', 58, 88, 15],
       [178, 'Male', 27, 88, 69],
       [179, 'Male', 59, 93, 14],
       [180, 'Male', 35, 93, 90],
       [181, 'Female', 37, 97, 32],
       [182, 'Female', 32, 97, 86],
       [183, 'Male', 46, 98, 15],
       [184, 'Female', 29, 98, 88],
       [185, 'Female', 41, 99, 39],
       [186, 'Male', 30, 99, 97],
       [187, 'Female', 54, 101, 24],
       [188, 'Male', 28, 101, 68],
       [189, 'Female', 41, 103, 17],
       [190, 'Female', 36, 103, 85],
       [191, 'Female', 34, 103, 23],
       [192, 'Female', 32, 103, 69],
       [193, 'Male', 33, 113, 8],
       [194, 'Female', 38, 113, 91],
       [195, 'Female', 47, 120, 16],
       [196, 'Female', 35, 120, 79],
       [197, 'Female', 45, 126, 28],
       [198, 'Male', 32, 126, 74],
       [199, 'Male', 32, 137, 18],
       [200, 'Male', 30, 137, 83]], dtype=object)

# 7) df.axes

return a list represeenting the axes of the dataframe

In [11]:
df.axes

[RangeIndex(start=0, stop=200, step=1),
 Index(['CustomerID', 'Genre', 'Age', 'Annual Income (k$)',
        'Spending Score (1-100)'],
       dtype='object')]

# 8) df.ndim

return 1 if series , return 2 if dataframe

In [12]:
df.ndim # dataframe

2

In [13]:
df['Age'].ndim # series

1

In [14]:
df[['Age']].ndim

2

# 9) df.shape

return dimenstion of the dataframe

In [15]:
df.shape

(200, 5)

In [16]:
df.shape[0]

200

# 10) df.size

return number of cells in the dataframe

In [17]:
df.size

1000

 # 11) df.memory_usage()

returns memory usage of the each column in bytes . df.info() returns entire df memory

In [18]:
df.memory_usage()

Index                      132
CustomerID                1600
Genre                     1600
Age                       1600
Annual Income (k$)        1600
Spending Score (1-100)    1600
dtype: int64

# 12) df.empty

returns true if empty

In [19]:
df.empty

False

# 13) df.astype()

used for type conversion

In [20]:
#df['Age']=df.astype({'Age':'int32'}).dtypes
# this method of type conversion is not working desired

In [21]:
df['Spending Score (1-100)']=df['Spending Score (1-100)'].astype('float')
df['Age']=df['Age'].astype('int32')
#df['B'] = df['B'].astype(float)

In [22]:
df.dtypes

CustomerID                  int64
Genre                      object
Age                         int32
Annual Income (k$)          int64
Spending Score (1-100)    float64
dtype: object

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int32
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    float64
dtypes: float64(1), int32(1), int64(2), object(1)
memory usage: 7.2+ KB

# 14) df.copy()

returns the copy of the dataframe otherwise normal assign(cusdata=df) will lead to changes  after some modification in the original dataframe

In [24]:
cusdata=df.copy()

# 15) df.head()

In [25]:
df.head(5)

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                    39.0
1           2    Male   21                  15                    81.0
2           3  Female   20                  16                     6.0
3           4  Female   23                  16                    77.0
4           5  Female   31                  17                    40.0

# 16) df.tail()

In [40]:
df.tail()

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                    79.0
196         197  Female   45                 126                    28.0
197         198    Male   32                 126                    74.0
198         199    Male   32                 137                    18.0
199         200    Male   30                 137                    83.0

# 17) df.at

displays the single value for row and column pair

In [41]:
df.at[2,'Genre']

'Female'

In [42]:
df.at[2,'Age']

20

# 18) df.iat

displays the value stored in the integer position[row,column]

In [43]:
df.iat[2,1]

'Female'

In [44]:
df.iat[2,2]

20

# 19)df.loc

access the row

In [48]:
df.loc[134] # returns single row in series

CustomerID                 135
Genre                     Male
Age                         20
Annual Income (k$)          73
Spending Score (1-100)     5.0
Name: 134, dtype: object

In [50]:
df.loc[[134,140]] # returns as dataframe

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
134         135    Male   20                  73                     5.0
140         141  Female   57                  75                     5.0

In [64]:
cusdata.loc[134:140,['Spending Score (1-100)','Annual Income (k$)']] # sliceing [start:end] in series

     Spending Score (1-100)  Annual Income (k$)
134                     5.0                  73
135                    88.0                  73
136                     7.0                  73
137                    73.0                  73
138                    10.0                  74
139                    72.0                  74
140                     5.0                  75

In [59]:
cusdata.loc[139,'Spending Score (1-100)']

72.0

In [65]:
cusdata.loc[cusdata['Annual Income (k$)']>100] # condition that return a dataframe

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
186         187  Female   54                 101                    24.0
187         188    Male   28                 101                    68.0
188         189  Female   41                 103                    17.0
189         190  Female   36                 103                    85.0
190         191  Female   34                 103                    23.0
191         192  Female   32                 103                    69.0
192         193    Male   33                 113                     8.0
193         194  Female   38                 113                    91.0
194         195  Female   47                 120                    16.0
195         196  Female   35                 120                    79.0
196         197  Female   45                 126                    28.0
197         198    Male   32                 126                    74.0
198         199    Male   32                 137                    18.0
199         200    Male   30                 137                    83.0

In [67]:
cusdata.loc[cusdata['Annual Income (k$)']==137]

     CustomerID Genre  Age  Annual Income (k$)  Spending Score (1-100)
198         199  Male   32                 137                    18.0
199         200  Male   30                 137                    83.0

# 20) df.iloc

purely integer-location based indexeing for selection by position

In [68]:
cusdata.iloc[3] # Access single row , return series

CustomerID                     4
Genre                     Female
Age                           23
Annual Income (k$)            16
Spending Score (1-100)      77.0
Name: 3, dtype: object

In [69]:
cusdata.iloc[[3]] # Access single row,return data frame

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
3           4  Female   23                  16                    77.0

In [70]:
cusdata.iloc[[3,4,5]] # access multiple rows

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
3           4  Female   23                  16                    77.0
4           5  Female   31                  17                    40.0
5           6  Female   22                  17                    76.0

In [71]:
cusdata.iloc[:10] # access first 10 rows

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                    39.0
1           2    Male   21                  15                    81.0
2           3  Female   20                  16                     6.0
3           4  Female   23                  16                    77.0
4           5  Female   31                  17                    40.0
5           6  Female   22                  17                    76.0
6           7  Female   35                  18                     6.0
7           8  Female   23                  18                    94.0
8           9    Male   64                  19                     3.0
9          10  Female   30                  19                    72.0

In [72]:
cusdata.iloc[195:]

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                    79.0
196         197  Female   45                 126                    28.0
197         198    Male   32                 126                    74.0
198         199    Male   32                 137                    18.0
199         200    Male   30                 137                    83.0

# 21) df.insert()

insert a new column at desired location

In [2]:
target=pd.DataFrame({  # create new dataframe
    'Name' : ['Sana','Ayad'],
    'RegNo' :[5,6]  
})

In [44]:
target

   Name  RegNo
0  Sana      5
1  Ayad      6

In [45]:
target.insert(2,'Marks',[100,100]) # insert new column

In [46]:
target

   Name  RegNo  Marks
0  Sana      5    100
1  Ayad      6    100

In [47]:
# insert new column with duplicates
target.insert(2,'Marks',[98,98],allow_duplicates=True)

In [48]:
target

   Name  RegNo  Marks  Marks
0  Sana      5     98    100
1  Ayad      6     98    100

# 22)df.items

In [49]:
target.items

<bound method DataFrame.items of    Name  RegNo  Marks  Marks
0  Sana      5     98    100
1  Ayad      6     98    100>

In [50]:

column_names=[]

for label,content in target.items():
    column_names.append(label)
    
print("Column name : ",','.join(column_names))

Column name :  Name,RegNo,Marks,Marks

In [52]:
for label,content in target.items():
     print(f"Column name :  {label} ")
     print(f"Content : {content} ",sep='\n')

Column name :  Name
Content : 0    Sana
1    Ayad
Name: Name, dtype: object
Column name :  RegNo
Content : 0    5
1    6
Name: RegNo, dtype: int64
Column name :  Marks
Content : 0    98
1    98
Name: Marks, dtype: int64
Column name :  Marks
Content : 0    100
1    100
Name: Marks, dtype: int64

# 23) df.keys()

gives the column name as df.columns

In [53]:
target.keys()

Index(['Name', 'RegNo', 'Marks', 'Marks'], dtype='object')

# 24) df.itertuples()

returns the row of the dataframe as named tuple

In [56]:
for row in target.itertuples():
    print(row)

Pandas(Index=0, Name='Sana', RegNo=5, Marks=98, _4=100)
Pandas(Index=1, Name='Ayad', RegNo=6, Marks=98, _4=100)

# 25) df.pop()

returns the column and drop the column from the dataframe

In [57]:
target.pop('Marks')

   Marks  Marks
0     98    100
1     98    100

In [58]:
target

   Name  RegNo
0  Sana      5
1  Ayad      6

# 26) df.get()

 item from the object

In [59]:
cusdata.get(["Age",'Genre'])

     Age   Genre
0     19    Male
1     21    Male
2     20  Female
3     23  Female
4     31  Female
..   ...     ...
195   35  Female
196   45  Female
197   32    Male
198   32    Male
199   30    Male

[200 rows x 2 columns]

# 27) df.isin(values)

check the values is contained the dataframe

In [61]:
df.isin([20,15])

     CustomerID  Genre    Age  Annual Income (k$)  Spending Score (1-100)
0         False  False  False                True                   False
1         False  False  False                True                   False
2         False  False   True               False                   False
3         False  False  False               False                   False
4         False  False  False               False                   False
..          ...    ...    ...                 ...                     ...
195       False  False  False               False                   False
196       False  False  False               False                   False
197       False  False  False               False                   False
198       False  False  False               False                   False
199       False  False  False               False                   False

[200 rows x 5 columns]

In [62]:
# extact oppossite
~df.isin([20,15])

     CustomerID  Genre    Age  Annual Income (k$)  Spending Score (1-100)
0          True   True   True               False                    True
1          True   True   True               False                    True
2          True   True  False                True                    True
3          True   True   True                True                    True
4          True   True   True                True                    True
..          ...    ...    ...                 ...                     ...
195        True   True   True                True                    True
196        True   True   True                True                    True
197        True   True   True                True                    True
198        True   True   True                True                    True
199        True   True   True                True                    True

[200 rows x 5 columns]

# 28) df.where()

In [7]:
filt=cusdata['Annual Income (k$)']>100
cusdata.where(filt)

     CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0           NaN     NaN   NaN                 NaN                     NaN
1           NaN     NaN   NaN                 NaN                     NaN
2           NaN     NaN   NaN                 NaN                     NaN
3           NaN     NaN   NaN                 NaN                     NaN
4           NaN     NaN   NaN                 NaN                     NaN
..          ...     ...   ...                 ...                     ...
195       196.0  Female  35.0               120.0                    79.0
196       197.0  Female  45.0               126.0                    28.0
197       198.0    Male  32.0               126.0                    74.0
198       199.0    Male  32.0               137.0                    18.0
199       200.0    Male  30.0               137.0                    83.0

[200 rows x 5 columns]

In [10]:
filt=cusdata['Annual Income (k$)']>100
filt1=cusdata['Age']>18
cusdata.where(filt & filt1)

     CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0           NaN     NaN   NaN                 NaN                     NaN
1           NaN     NaN   NaN                 NaN                     NaN
2           NaN     NaN   NaN                 NaN                     NaN
3           NaN     NaN   NaN                 NaN                     NaN
4           NaN     NaN   NaN                 NaN                     NaN
..          ...     ...   ...                 ...                     ...
195       196.0  Female  35.0               120.0                    79.0
196       197.0  Female  45.0               126.0                    28.0
197       198.0    Male  32.0               126.0                    74.0
198       199.0    Male  32.0               137.0                    18.0
199       200.0    Male  30.0               137.0                    83.0

[200 rows x 5 columns]

In [13]:
cusdata.loc[(cusdata['Annual Income (k$)']>100) &  (cusdata['Age']>18) ]

# df.where() ,df.loc having same condition but different output . 
# df.where includes NAN value for those doesnt satisfy the condition

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
186         187  Female   54                 101                      24
187         188    Male   28                 101                      68
188         189  Female   41                 103                      17
189         190  Female   36                 103                      85
190         191  Female   34                 103                      23
191         192  Female   32                 103                      69
192         193    Male   33                 113                       8
193         194  Female   38                 113                      91
194         195  Female   47                 120                      16
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

# 29) df.mask()

replace with oiginal values in the dataFrame

In [15]:
cusdata.mask(filt) # single condition

     CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0           1.0    Male  19.0                15.0                    39.0
1           2.0    Male  21.0                15.0                    81.0
2           3.0  Female  20.0                16.0                     6.0
3           4.0  Female  23.0                16.0                    77.0
4           5.0  Female  31.0                17.0                    40.0
..          ...     ...   ...                 ...                     ...
195         NaN     NaN   NaN                 NaN                     NaN
196         NaN     NaN   NaN                 NaN                     NaN
197         NaN     NaN   NaN                 NaN                     NaN
198         NaN     NaN   NaN                 NaN                     NaN
199         NaN     NaN   NaN                 NaN                     NaN

[200 rows x 5 columns]

In [16]:
cusdata.mask( filt & filt1)  # using two condition

     CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0           1.0    Male  19.0                15.0                    39.0
1           2.0    Male  21.0                15.0                    81.0
2           3.0  Female  20.0                16.0                     6.0
3           4.0  Female  23.0                16.0                    77.0
4           5.0  Female  31.0                17.0                    40.0
..          ...     ...   ...                 ...                     ...
195         NaN     NaN   NaN                 NaN                     NaN
196         NaN     NaN   NaN                 NaN                     NaN
197         NaN     NaN   NaN                 NaN                     NaN
198         NaN     NaN   NaN                 NaN                     NaN
199         NaN     NaN   NaN                 NaN                     NaN

[200 rows x 5 columns]

# 30) df.query()

used to pass the SQL type queries

In [19]:
cusdata.query('Age>=18 and Genre=="Male"')
# Note : pass entrie query with quotes

     CustomerID Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1  Male   19                  15                      39
1             2  Male   21                  15                      81
8             9  Male   64                  19                       3
10           11  Male   67                  19                      14
14           15  Male   37                  20                      13
..          ...   ...  ...                 ...                     ...
187         188  Male   28                 101                      68
192         193  Male   33                 113                       8
197         198  Male   32                 126                      74
198         199  Male   32                 137                      18
199         200  Male   30                 137                      83

[88 rows x 5 columns]

# 31) df.add()

get addition of the dataframe columnwise

In [26]:
temp=pd.DataFrame({
    'height' : [146,156,134,178],
    'weight' : [70,56,54,78] 
})

In [23]:
temp

   height  weight
0     146      70
1     156      56
2     134      54
3     178      78

In [24]:
temp[['height','weight']] + 1.5 # adding 1.5 in all rows and columns

   height  weight
0   147.5    71.5
1   157.5    57.5
2   135.5    55.5
3   179.5    79.5

In [25]:
temp[['height','weight']] + [0.5,1.5] # adding

   height  weight
0   146.5    71.5
1   156.5    57.5
2   134.5    55.5
3   178.5    79.5

In [27]:
temp.insert(2,'BMI',[34,36,37,37])

In [28]:
temp

   height  weight  BMI
0     146      70   34
1     156      56   36
2     134      54   37
3     178      78   37

In [29]:
# the value is given with corresponding column names 
temp[['height','weight']] + {'height' : 1.5 ,  'weight' : 1.0}

   height  weight
0   147.5    71.0
1   157.5    57.0
2   135.5    55.0
3   179.5    79.0

In [30]:
other=pd.DataFrame({
    'height' :[0.1,0.1,0.1,0.1]
})

In [31]:
other

   height
0     0.1
1     0.1
2     0.1
3     0.1

In [36]:
temp[['height','weight']] + other

   height  weight
0   146.1     NaN
1   156.1     NaN
2   134.1     NaN
3   178.1     NaN

In [37]:
temp.add(1)

   height  weight  BMI
0     147      71   35
1     157      57   37
2     135      55   38
3     179      79   38

# 32) df.sub()

In [39]:
temp.sub(1)

   height  weight  BMI
0     145      69   33
1     155      55   35
2     133      53   36
3     177      77   36

# 32) df.mul()

In [40]:
temp.mul(2)

   height  weight  BMI
0     292     140   68
1     312     112   72
2     268     108   74
3     356     156   74

# 33) df.div()

In [41]:
temp.div(2)

   height  weight   BMI
0    73.0    35.0  17.0
1    78.0    28.0  18.0
2    67.0    27.0  18.5
3    89.0    39.0  18.5

# 34) df.truediv()

In [42]:
temp.truediv(2)

   height  weight   BMI
0    73.0    35.0  17.0
1    78.0    28.0  18.0
2    67.0    27.0  18.5
3    89.0    39.0  18.5

# 35) df.floordiv()

In [43]:
temp.floordiv(5)

   height  weight  BMI
0      29      14    6
1      31      11    7
2      26      10    7
3      35      15    7

# 36)df.mod()

In [27]:
temp.mod(5)

   height  weight
0       1       0
1       1       1
2       4       4
3       3       3

# 37) df.pow()

displays the answer by applying power

In [29]:
temp.pow(2)

   height  weight
0   21316    4900
1   24336    3136
2   17956    2916
3   31684    6084

In [30]:
temp

   height  weight
0     146      70
1     156      56
2     134      54
3     178      78

# 38) df.dot()

Gives the matrix multiplication

In [34]:
df1= pd.DataFrame([[1,2,-1,0] , [-1,1,-1,0]])
df1

   0  1  2  3
0  1  2 -1  0
1 -1  1 -1  0

In [37]:
df2=pd.DataFrame([[1,2], [1,-1], [0,1], [1,-1]])
df2

   0  1
0  1  2
1  1 -1
2  0  1
3  1 -1

In [38]:
df1.dot(df2)

   0  1
0  3 -1
1  0 -4

# 39) df.radd()

get addition of the dataframe in reverse opr1 + opr2----->opr2 radd opr1

In [39]:
temp

   height  weight
0     146      70
1     156      56
2     134      54
3     178      78

In [40]:
temp.radd(1)

   height  weight
0     147      71
1     157      57
2     135      55
3     179      79

In [41]:
temp.add(1)

   height  weight
0     147      71
1     157      57
2     135      55
3     179      79

# 40) df.rsub()

In [42]:
temp.rsub(1)

   height  weight
0    -145     -69
1    -155     -55
2    -133     -53
3    -177     -77

# 41)df.rmul()

In [43]:
temp.rmul(2)

   height  weight
0     292     140
1     312     112
2     268     108
3     356     156

# 42)df.rdiv()

In [44]:
temp.rdiv(2)

     height    weight
0  0.013699  0.028571
1  0.012821  0.035714
2  0.014925  0.037037
3  0.011236  0.025641

# 43) df.rfloordiv()

In [47]:
temp.rfloordiv(2)

   height  weight
0       0       0
1       0       0
2       0       0
3       0       0

In [48]:
temp

   height  weight
0     146      70
1     156      56
2     134      54
3     178      78

In [50]:
temp.floordiv(2)

   height  weight
0      73      35
1      78      28
2      67      27
3      89      39

# 44) df.rmod()

In [51]:
temp.rmod(3)

   height  weight
0       3       3
1       3       3
2       3       3
3       3       3

# 45)df.rpow()

In [59]:
temp.rpow(2)

   height             weight
0       0                  0
1       0  72057594037927936
2       0  18014398509481984
3       0                  0

# 46) df.lt()

gives boolean value by taking less than of the parameter

In [62]:
temp.lt(2)   # 146<2 = false

   height  weight
0   False   False
1   False   False
2   False   False
3   False   False

# 47) df.gt()

In [65]:
temp.gt(2)

   height  weight
0    True    True
1    True    True
2    True    True
3    True    True

# 48) df.le()

lesser than or equal to

In [66]:
temp.le(100)

   height  weight
0   False    True
1   False    True
2   False    True
3   False    True

 # 49)df.ge()
 greater than or equal to

In [67]:
temp.ge(100)

   height  weight
0    True   False
1    True   False
2    True   False
3    True   False

# 50) df.ne()
not equal to

In [68]:
temp.ne(100)

   height  weight
0    True    True
1    True    True
2    True    True
3    True    True

# 51) df.eq()
equal to

In [69]:
temp.eq(146)

   height  weight
0    True   False
1   False   False
2   False   False
3   False   False